historic/archive/buffered/m2.x4large_piops1000_4000/randread-02-512.fio.out
randread-512: (g=0): rw=randread, bs=512-512/512-512/512-512, ioengine=libaio, iodepth=10
fio-2.1.4
Starting 1 process

randread-512: (groupid=0, jobs=1): err= 0: pid=31019: Sun Mar 16 02:35:50 2014
  read : io=271950KB, bw=4532.5KB/s, iops=9064, runt= 60001msec
    slat (usec): min=3, max=39568, avg=106.91, stdev=140.37
    clat (usec): min=3, max=40798, avg=991.41, stdev=689.70
     lat (usec): min=7, max=40984, avg=1098.62, stdev=754.16
    clat percentiles (usec):
     |  1.00th=[   52],  5.00th=[   55], 10.00th=[  274], 20.00th=[  306],
     | 30.00th=[  516], 40.00th=[  724], 50.00th=[  828], 60.00th=[ 1048],
     | 70.00th=[ 1320], 80.00th=[ 1640], 90.00th=[ 1976], 95.00th=[ 2192],
     | 99.00th=[ 2416], 99.50th=[ 2608], 99.90th=[ 4256], 99.95th=[ 5920],
     | 99.99th=[ 7392]
    bw (KB  /s): min= 1203, max=14233, per=98.21%, avg=4450.91, stdev=2830.73
    lat (usec) : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.02%, 100=7.10%
    lat (usec) : 250=0.01%, 500=18.23%, 750=18.76%, 1000=13.02%
    lat (msec) : 2=33.55%, 4=9.21%, 10=0.10%, 20=0.01%, 50=0.01%
  cpu          : usr=1.84%, sys=12.17%, ctx=233437, majf=0, minf=25
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=543900/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=271950KB, aggrb=4532KB/s, minb=4532KB/s, maxb=4532KB/s, mint=60001msec, maxt=60001msec

Disk stats (read/write):
  xvdh: ios=232114/0, merge=0/0, ticks=56655/0, in_queue=56647, util=94.43%